/**
 * @author Dmitry Tkachenko
 * @version 1.0 6/2/17
 */


/*
    1. Создать три потока, каждый из которых выводит определенную букву(A, B и C) 5 раз, порядок
    должен быть именно ABСABСABС. Используйте wait/notify/notifyAll.

    2. Написать совсем небольшой метод, в котором 3 потока построчно пишут данные в файл (штук
    по 10 записей, с периодом в 20 мс)

    3. Написать класс МФУ на котором возможны одновременная печать и сканирование
    документов, при этом нельзя одновременно печатать два документа или сканировать (при
    печати в консоль выводится сообщения "отпечатано 1, 2, 3,... страницы", при сканировании то
    же самое только "отсканировано...", вывод в консоль все также с периодом в 50 мс.)
*/
public class Task4 {

    public static void main(String[] args) {
    }
}
